# macOS Homebrew Bundle
# Usage: brew bundle --file ~/.config/macos/Brewfile

# Taps
tap "felixkratz/formulae"
tap "nikitabobko/tap"

# CLI tools
brew "bat"
brew "fd"
brew "fzf"
brew "git"
brew "lazygit"
brew "lsd"
brew "neovim"
brew "ripgrep"
brew "rsync"
brew "tmux"
brew "yazi"
brew "zoxide"
brew "zsh"
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Terminal
cask "alacritty"

# Window management
brew "nikitabobko/tap/aerospace"
brew "felixkratz/formulae/borders"
